## Plan Result (sbox-aks)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
* Replace
  * module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes[1].data.azurerm_resource_group.node_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "node_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "cft-sbox-01-aks-node-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks"
        name                                = "cft-sbox-01-aks"
      ~ tags                                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks|DiagLogAnalytics"
        name                       = "DiagLogAnalytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "cloud-controller-manager" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "cluster-autoscaler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      - log {
          - category = "csi-azuredisk-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azurefile-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-snapshot-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "guard" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      - log {
          - category = "kube-apiserver" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      - log {
          - category = "kube-audit" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit-admin" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      - log {
          - category = "kube-controller-manager" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      - log {
          - category = "kube-scheduler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set must be replaced
-/+ resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/084bca1b-6f36-50ff-f75d-0e65c7572e02" -> (known after apply)
      ~ name                             = "084bca1b-6f36-50ff-f75d-0e65c7572e02" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":315,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->